"""
Рост дочерей 175, 167, 154, 174, 178, 148, 160, 167, 169, 170
Рост матерей 178, 165, 165, 173, 168, 155, 160, 164, 178, 175

Используя эти данные построить 95% доверительный интервал для разности среднего
роста родителей и детей.


Δ +- tα/2 * SΔ
SΔ = √(D/n1 + D/n2)
D = 1/2(D1+D2)

-1.9 +- 2.021 * 3.888

(-9.76; 5.97)

"""
import numpy as np

a = np.array([175, 167, 154, 174, 178, 148, 160, 167, 169, 170])
b = np.array([178, 165, 165, 173, 168, 155, 160, 164, 178, 175])


x1 = np.mean(a)
x2 = np.mean(b)
print(x1, x2)
Δ = x1 -x2
print(round(Δ, 4))

D1 = np.var(a, ddof=1)
D2 = np.var(b, ddof=1)
print(round(D1, 4), round(D2, 4))
D = (D1 + D2)/2
print(round(D, 4))
SΔ = np.sqrt(D / len(a) + D / len(b))
print(round(SΔ, 4))

result1 = Δ - 2.021 * SΔ
result2 = Δ + 2.021 * SΔ

print(f"Интервал {round(result1, 2), round(result2, 2)}")